In [61]:
import pandas as pd

In [62]:
file = 'employee_data1.csv'
file2 = 'employee_data2.csv'

In [63]:
name_df = pd.read_csv(file)
name_df.head()

   Emp ID           Name         DOB          SSN         State
0     214  Sarah Simpson  1985-12-04  282-01-8166       Florida
1      15  Samantha Lara  1993-09-08  848-80-7526      Colorado
2     411  Stacy Charles  1957-12-20  658-75-8526  Pennsylvania
3     166   Michelle Roy  1978-07-29  794-25-3944      Michigan
4      39  Joseph Rogers  1985-03-28  525-40-3515     Minnesota

In [64]:
# The Name column should be split into separate First Name and Last Name columns.

name_df[['first_name','last_name']] = name_df['Name'].loc[name_df['Name'].str.split().str.len() == 2].str.split(expand=True)
name_df.head()

,Emp ID,Name,DOB,SSN,State,first_name,last_name
0,214,Sarah Simpson,1985-12-04,282-01-8166,Florida,Sarah,Simpson
1,15,Samantha Lara,1993-09-08,848-80-7526,Colorado,Samantha,Lara
2,411,Stacy Charles,1957-12-20,658-75-8526,Pennsylvania,Stacy,Charles
3,166,Michelle Roy,1978-07-29,794-25-3944,Michigan,Michelle,Roy
4,39,Joseph Rogers,1985-03-28,525-40-3515,Minnesota,Joseph,Rogers

In [65]:
name_df.head()

,Emp ID,Name,DOB,SSN,State,first_name,last_name
0,214,Sarah Simpson,1985-12-04,282-01-8166,Florida,Sarah,Simpson
1,15,Samantha Lara,1993-09-08,848-80-7526,Colorado,Samantha,Lara
2,411,Stacy Charles,1957-12-20,658-75-8526,Pennsylvania,Stacy,Charles
3,166,Michelle Roy,1978-07-29,794-25-3944,Michigan,Michelle,Roy
4,39,Joseph Rogers,1985-03-28,525-40-3515,Minnesota,Joseph,Rogers

In [66]:
#The DOB data should be re-written into MM/DD/YYYY format.

name_df['DOB'] = pd.to_datetime(name_df.DOB)

name_df['DOB1'] = name_df['DOB'].dt.strftime('%m/%d/%Y')

name_df.head()

,Emp ID,Name,DOB,SSN,State,first_name,last_name,DOB1
0,214,Sarah Simpson,1985-12-04,282-01-8166,Florida,Sarah,Simpson,12/04/1985
1,15,Samantha Lara,1993-09-08,848-80-7526,Colorado,Samantha,Lara,09/08/1993
2,411,Stacy Charles,1957-12-20,658-75-8526,Pennsylvania,Stacy,Charles,12/20/1957
3,166,Michelle Roy,1978-07-29,794-25-3944,Michigan,Michelle,Roy,07/29/1978
4,39,Joseph Rogers,1985-03-28,525-40-3515,Minnesota,Joseph,Rogers,03/28/1985

In [67]:
del name_df['DOB']
name_df=name_df.rename(columns={'DOB1':'DOB'})
name_df.head()

,Emp ID,Name,SSN,State,first_name,last_name,DOB
0,214,Sarah Simpson,282-01-8166,Florida,Sarah,Simpson,12/04/1985
1,15,Samantha Lara,848-80-7526,Colorado,Samantha,Lara,09/08/1993
2,411,Stacy Charles,658-75-8526,Pennsylvania,Stacy,Charles,12/20/1957
3,166,Michelle Roy,794-25-3944,Michigan,Michelle,Roy,07/29/1978
4,39,Joseph Rogers,525-40-3515,Minnesota,Joseph,Rogers,03/28/1985

In [68]:
name_df["SSN mask"]="****-**-" +name_df["SSN"].str[-4]

In [69]:
name_df["SSN mask"]

0      ****-**-8
1      ****-**-7
2      ****-**-8
3      ****-**-3
4      ****-**-3
5      ****-**-6
6      ****-**-0
7      ****-**-0
8      ****-**-1
9      ****-**-2
10     ****-**-2
11     ****-**-7
12     ****-**-2
13     ****-**-0
14     ****-**-6
15     ****-**-8
16     ****-**-1
17     ****-**-7
18     ****-**-6
19     ****-**-0
20     ****-**-0
21     ****-**-5
22     ****-**-1
23     ****-**-7
24     ****-**-6
25     ****-**-4
26     ****-**-2
27     ****-**-7
28     ****-**-4
29     ****-**-2
         ...
620    ****-**-9
621    ****-**-5
622    ****-**-0
623    ****-**-6
624    ****-**-8
625    ****-**-4
626    ****-**-7
627    ****-**-6
628    ****-**-9
629    ****-**-9
630    ****-**-5
631    ****-**-0
632    ****-**-5
633    ****-**-1
634    ****-**-7
635    ****-**-8
636    ****-**-8
637    ****-**-0
638    ****-**-1
639    ****-**-4
640    ****-**-1
641    ****-**-6
642    ****-**-5
643    ****-**-4
644    ****-**-7
645    ****-**-1
646    ****-**-6
647    ****-**-4
648    ****-**-5
649    ****-**-3
Name: SSN mask, Length: 650, dtype: object

In [70]:
states_df = pd.read_csv(file)
name_df = name_df.merge(states_df, left_on="State", right_on="State", how="left")

name_df["State Abbrv"] = name_df["State"].replace({
    'Alabama': 'AL',
    'Alaska': 'AK',
    'Arizona': 'AZ',
    'Arkansas': 'AR',
    'California': 'CA',
    'Colorado': 'CO',
    'Connecticut': 'CT',
    'Delaware': 'DE',
    'Florida': 'FL',
    'Georgia': 'GA',
    'Hawaii': 'HI',
    'Idaho': 'ID',
    'Illinois': 'IL',
    'Indiana': 'IN',
    'Iowa': 'IA',
    'Kansas': 'KS',
    'Kentucky': 'KY',
    'Louisiana': 'LA',
    'Maine': 'ME',
    'Maryland': 'MD',
    'Massachusetts': 'MA',
    'Michigan': 'MI',
    'Minnesota': 'MN',
    'Mississippi': 'MS',
    'Missouri': 'MO',
    'Montana': 'MT',
    'Nebraska': 'NE',
    'Nevada': 'NV',
    'New Hampshire': 'NH',
    'New Jersey': 'NJ',
    'New Mexico': 'NM',
    'New York': 'NY',
    'North Carolina': 'NC',
    'North Dakota': 'ND',
    'Ohio': 'OH',
    'Oklahoma': 'OK',
    'Oregon': 'OR',
    'Pennsylvania': 'PA',
    'Rhode Island': 'RI',
    'South Carolina': 'SC',
    'South Dakota': 'SD',
    'Tennessee': 'TN',
    'Texas': 'TX',
    'Utah': 'UT',
    'Vermont': 'VT',
    'Virginia': 'VA',
    'Washington': 'WA',
    'West Virginia': 'WV',
    'Wisconsin': 'WI',
    'Wyoming': 'WY'
})

name_df.head()

,Emp ID_x,Name_x,SSN_x,State,first_name,last_name,DOB_x,SSN mask,Emp ID_y,Name_y,DOB_y,SSN_y,State Abbrv
0,214,Sarah Simpson,282-01-8166,Florida,Sarah,Simpson,12/04/1985,****-**-8,214,Sarah Simpson,1985-12-04,282-01-8166,FL
1,214,Sarah Simpson,282-01-8166,Florida,Sarah,Simpson,12/04/1985,****-**-8,637,Sarah Wood,1972-06-15,235-96-6715,FL
2,214,Sarah Simpson,282-01-8166,Florida,Sarah,Simpson,12/04/1985,****-**-8,300,Ernest Washington,1990-07-15,620-77-9800,FL
3,214,Sarah Simpson,282-01-8166,Florida,Sarah,Simpson,12/04/1985,****-**-8,631,Rebecca Pollard,1977-03-17,217-17-9010,FL
4,214,Sarah Simpson,282-01-8166,Florida,Sarah,Simpson,12/04/1985,****-**-8,524,Matthew Wells,1958-08-29,241-85-2780,FL

In [ ]:
#practice formulas
name_df=pd.DataFrame({'Emp ID','Name','DOB','SSN','State','first_name','last_name'})
name_df.columns =
name_df['DOB1'] = name_df['DOB1'].replace['DOB1':'DOB']